"espk" = "Порт колонок Apple";
"ispk" = "Вбудований";
"emic" = "Порт мікрофона";
"imic" = "Вбудований";
"hdpn" = "Порт навушників";
"lini" = "Лінійний аудіовхід";
"lino" = "Лінійний аудіовихід";
"spdi" = "Оптичний цифровий вхід";
"spdo" = "Оптичний цифровий вихід";
"pci " = "PCI-карта";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Мережевий пристрій";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-навушники";
"blus" = "Bluetooth-гарнітура";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
